// ignore_for_file: file_names, duplicate_ignore
// ignore: file_names
// ignore: file_names
///Flutter - 2 основные вещи
///1 - SDK(Software development Kit) - набор инструментов для компиляции в нативный 
///машинный код под каждую платформу(Android, IOS)
///2 Framework - сам среда разработки и библиотека виджетов, служебные функции
///и пакеты для помощи в разработке
///Виджеты - многоразовые строит блоки UI(пользовательского интерфейса). Примеры
///виджетов:кнопки, вкладки, ввод текста, выпад списки и тд
///
///Архитектура Flutter
///Всё есть виджет! Любая сущность пользовательского интерфейса — виджет. 
///Текстовое поле, отступ или детектор жестов — виджеты.Нет редактора графич, 
///мы строим дерево виджетов посредством кода
///Учитывает различия платформ - мы работаем в одном проекте, но если нужно мы
///можем создавать различные вещи на какой-то конктретной отдельно
///В качестве графического движка под капотом используется Skia
///от 60 до  120 FPS(кадров в секунду) при отрисовке UI
///
///Команда cd в командной строке - переход в указанную папку
///
///При создании переменной которой сразу присваивается знач - var, просто при 
///инициализации - явно указывать тип.
///
///class - позволяет определять схему объекта. У класса должно быть имя и здесь
///именования не LCC, а 1ая буква прописная. Переменная в классе - называют свойством,
///для того чтобы отличать переменную в функции и свойство(перем в классе). Также
///функция которая находится в классе - называется метод.
///
///
///